Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: Joystick remapping: methods of sending keystrokes and mouse clicks with a joystick.
fr: Remappage du joystick: méthodes d'envoi de frappes et de clics de souris avec un joystick.

source: Joystick-To-Mouse script:
fr: Script Joystick-To-Mouse:

source: Legacy If equal:
fr: Egalité If dépassée (legacy) :

source: Legacy assignment assigns unquoted text to a variable.
fr: Une affectation dépassée (legacy) affecte du texte sans guillemets à une variable.

source: Legacy assignment:
fr: Affectation dépassée (legacy) :

source: Line continuation, where lines that begin with an expression operator (except ++ and --) are merged with the previous line.
fr: La continuation de ligne, où les lignes qui commencent par un opérateur d'expression (sauf ++ et --) sont fusionnées avec la ligne précédente.

source: ListLines, KeyHistory, and OutputDebug.
fr: ListLines, KeyHistory, et OutputDebug.

source: Loop Count executes a statement repeatedly:
fr: Loop Count exécute une instruction de manière répétée :

source: Loop Files retrieves the specified files or folders, one at a time.
fr: Loop Files récupère les fichiers ou dossiers spécifiés, un à la fois.

source: Loop Parse retrieves substrings (fields) from a string, one at a time.
fr: Loop Parse récupère les sous-chaînes (champs) d'une chaîne de caractères, une à la fois.

source: Loop Read retrieves the lines in a text file, one at a time.
fr: Loop Read récupère les lignes d'un fichier texte, une à la fois.

source: Loop Reg retrieves the contents of the specified registry subkey, one item at a time.
fr: Loop Reg récupère le contenu de la sous-clé spécifiée du registre, un élément à la fois.

source: Lots and lots of them.
fr: Vraiment beaucoup.

source: MsgBox, 4,, Would you like to continue?
fr: MsgBox, 4,, Aimeriez-vous continuer ?

source: Objects are a way of organizing your data for more efficient usage.
fr: Les objets (objects) sont une manière d'organiser des données pour une utilisation plus efficace.

source: Optional parameters are specified by following the parameter name with := or = and a default value, which must be a literal quoted string, a number, true or false.
fr: Les paramètres facultatifs ou optionnels sont spécifiés en faisant suivre le nom du paramètre avec := ou = et une valeur par défaut, qui doit être une chaîne entre guillemets littérale, un nombre, true ou false.

source: Passing Command Line Parameters to a Script:
fr: Passer des Paramètres de Ligne de Commande à un Script : Les variables %1%, %2%, etc.

source: RegExMatch, except when given the O) option, which causes it to output a single object containing all match information.
fr: RegExMatch, sauf avec l'option O), qui change la sortie en un seul objet contenant toutes les informations sur la correspondance (sur le "match").

source: RegWrite may be used to set the default for scripts launched from Explorer (e.g. by double-clicking a file):
fr: RegWrite peut être utilisée pour définir le codepage par défaut pour les scripts lancés depuis l'explorateur (par exemple en double-cliquant un fichier) :

source: Return returns from a subroutine or function.
fr: Return renvoie depuis un sous-programme ou une fonction.

source: Run tries both.
fr: La commande Run essaie les deux.

source: RunWait %ComSpec% /c dir > C:\My Temp File.txt
fr: RunWait %ComSpec% /c dir > C:\Mon Fichier Temporaire.txt

source: Script File Codepage:
fr: Codepage de Fichier de Script :

source: Script compatibility - AutoHotkey 1.0 users read this
fr: Compatibilité des scripts - utilisateurs de AutoHotkey 1.0 lisez

source: Scripting Language:
fr: Language de Script :

source: Scripting language:
fr: Langage de script :

source: Set parameter default value:
fr: Définir la valeur par défaut d'un paramètre :

source: SoundGet, SoundSet, SoundGetWaveVolume and SoundSetWaveVolume behave differently on Vista and later than on earlier versions of Windows.
fr: SoundGet, SoundSet, SoundGetWaveVolume et SoundSetWaveVolume se comportement différemment sur Vista et au-delà que sur des versions plus vieilles de Windows.

source: Splitting a Long Line into a Series of Shorter Ones:
fr: Diviser une Longue Ligne en une Série de Lignes Plus Courtes :

source: Statements are grouped together into a block by enclosing them in braces {}, as in C, JavaScript and similar languages, but usually the braces must appear at the start of a line.
fr: Les instructions sont groupées en blocs en les mettant entre accolades {}, comme en C, en JavaScript et des langages similaires, mais en général les accolades doivent apparaître en début de ligne.

source: Switch executes one case from a list of mutually exclusive candidates.
fr: Switch exécute un cas d'une liste de candidats mutuellement exclusifs.

source: SysGet Monitor/MonitorWorkArea, as demonstrated above.
fr: SysGet Monitor/MonitorWorkArea, comme démontré plus haut.

source: The Top of the Script (the Auto-execute Section):
fr: Le Haut du Script (Section d'Auto-exécution) :

source: The WinTitle Parameter & the Last Found Window.
fr: Le paramètre WinTitle & la Dernière Fenêtre Trouvée (Last Found Window).

source: Throw throws an exception to be handled by try/catch or display an error dialog.
fr: Throw (lancer) lance une exception à gérer par try/catch ou affichée dans une boîte de dialogue d'erreur.

source: Try guards its body against runtime errors and exceptions thrown by the throw command.
fr: Try (essayer) surveille les erreurs lors de l'exécution dans son corps et les exceptions lancées par la commande throw.

source: Until causes a loop to terminate when an expression evaluates to true.
fr: Until (jusqu'à) fait terminer une boucle quand une expression est évaluée vraie.

source: User Account Control (UAC) is a common cause of problems, especially when moving from Windows XP/Vista/7 to Vista/7/8/10.
fr: Le contrôle du compte d'utilisateur est une cause courante de problèmes, surtout lors du passage de Windows XP/Vista/7 à Vista/7/8/10.

source: Using the Program:
fr: Utiliser le Programme :

source: Variables are like little post-it notes that hold some information.
fr: Les variables sont comme des petits post-its qui contiennent de l'information.

source: While executes a statement repeatedly until the specified expression evaluates to false.
fr: While exécute une instruction de manière répétée jusqu'à ce que l'expression spécifiée soit évaluée à faux.

source: create a script file → add some hotkeys → run the script file.
fr: créer un fichier de script → ajouter des hotkeys → exécuter le fichier de script.

source: legacy syntax and expressions.
fr: la syntaxe dépassée (legacy) et les expressions.

source: Array elements, properties and other expressions are not supported.
fr: Les éléments de tableau, les propriétés et autres expressions ne sont pas pris en charge.

source: Compile AHK can be used to facilitate this process.
fr: Compile AHK peut être utilisé pour faciliter ce processus.

source: Changing the title prevents the script from being identified as such.
fr: Modifier le titre empêche le script d'être identifié ainsi.

source: AutoTrim, CoordMode, Critical, DetectHiddenText, DetectHiddenWindows, FileEncoding, ListLines, SendLevel, SendMode, SetBatchLines, SetControlDelay, SetDefaultMouseSpeed, SetFormat, SetKeyDelay, SetMouseDelay, SetRegView, SetStoreCapsLockMode, SetTitleMatchMode, SetWinDelay, StringCaseSense, and Thread.
fr: AutoTrim, CoordMode, Critical, DetectHiddenText, DetectHiddenWindows, FileEncoding, ListLines, SendLevel, SendMode, SetBatchLines, SetControlDelay, SetDefaultMouseSpeed, SetFormat, SetKeyDelay, SetMouseDelay, SetRegView, SetStoreCapsLockMode, SetTitleMatchMode, SetWinDelay, StringCaseSense, et Thread.

source: "The value is " . MyVar
fr: "La valeur est " . MaVar

source: "The value is " MyVar
fr: "La valeur est " MaVar

source: /A32 or /ANSI:
fr: /A32 ou /ANSI :

source: /U64 or /x64:
fr: /U64 ou /x64 :

source: Format("{:L}", input), Format("{:U}", input) or Format("{:T}", input)
fr: Format("{:L}", entrée), Format("{:U}", entrée) ou Format("{:T}", entrée)

source: StringLen, OutputVar, InputVar
fr: StringLen, VarSortie, VarEntree

source: Alpha.Beta() is a method call, as described above.
fr: Alpha.Beta() est un appel de méthode, comme décrit ci-dessus.

source: Alpha.Beta is often called member access.
fr: Alpha.Beta est souvent appelé accès de membre.

source: Alpha.Beta[Param] is a specialised form of member access which includes additional parameters in the request.
fr: Alpha.Beta[Param] est une forme spécialisée d'accès de membre qui inclut des paramètres supplémentaires dans la requête.

source: Alpha[Index] has a similar function to Alpha.Beta, but each part is interpreted in a more standard way.
fr: Alpha[Index] a une fonction similaire à celle de Alpha.Beta, mais chaque partie est interprétée de manière plus standard.

source: Hotkey, IfSomething, where Something is invalid, is not tolerated.
fr: Hotkey, IfQuelque chose, où Quelque chose n'est pas valide, n'est pas toléré.

source: If, Else, Loop, While, For, Try, Catch and Finally.
fr: If, Else, Loop, While, For, Try, Catch et Finally.

source: MsgBox % %second% → MsgBox % target:
fr: MsgBox % %deuxième% → MsgBox % cible :

source: MsgBox %second% → MsgBox target:
fr: MsgBox %deuxième% → MsgBox cible :

source: MyFunc(Params*) is a variadic function call.
fr: MaFonction(Params*) est un appel de fonction variadic.

source: Send, My First Script is how you send keystrokes.
fr: Send, Mon Premier Script est la méthode pour envoyer des appuis de touches.

source: [A, B, C] creates an array with the initial contents A, B and C (all variables in this case), where A is element 1.
fr: [A, B, C] crée un tableau avec comme contenu initial A, B et C (dans ce cas toutes des variables), où A est l'élément 1.

source: ^j:: is the hotkey.
fr: ^j:: est la hotkey.

source: between, in, contains and is are only valid in this context; they cannot be used in expressions.
fr: between (entre), in (dans), contains (contient) et is (est) ne sont valides que dans ce contexte ; ils ne peuvent pas être utilisés dans les expressions.

source: new ClassName() is used to instantiate a class, or create an object derived from another object.
fr: new NomClasse() est utilisé pour instancier une classe, ou créer un objet dérivé d'un autre objet.

source: x & y:: causes both x:: and x up:: to fire when x is released
fr: x & y :: provoque le déclenchement de x :: et de x up :: lorsque x est relâché

source: {Key1:
fr: {Clé1:

source: ^A produces a different effect in some programs than ^a.
fr: ^A peut avoir dans certains programmes un effet différent de ^a,

source: "She said, ""An apple a day.""".
fr: "Elle disait, ""Une pomme le matin.""".

source: =, <> or !=, >, >=, < and <=.
fr: =, <> ou !=, >, >=, < et <=.

source: MsgBox The current percentage is 25`%. Literal commas must also be escaped (`,) except when used in MsgBox or the last parameter of any command (in which case the accent is permitted but not necessary).
fr: MsgBox Le pourcentage actuel est 25`%. Les virgules littérales doivent aussi être échappées (`,) sauf si elles sont utilisées dans une MsgBox ou dans le dernier paramètre de n'importe quelle commande (auquel cas le backtick peut être mis mais est non nécessaire).

source: MyFunc(Param="Default value") {...
fr: MaFonc(Param="valeur par défaut") {...

source: Run, Notepad.exe "C:\My Documents\Address List.txt".
fr: Run, Notepad.exe "C:\Mes Documents\Liste Adresses.txt".

source: Var = Value
fr: Var = Valeur

source: ^ means Ctrl, j is the letter J.
fr: ^ signifie Ctrl, j est la lettre J.

source: if (Expr1 = Expr2) (also valid in other expressions, not just if)
fr: if (Expr1 = Expr2) (aussi valide dans d'autres expressions, pas juste if)

source: if Var = Value
fr: if Var = Valeur

source: local x = Expr (always accepts an expression)
fr: local x = Expr (accepte toujours une expression)

source: x:=1, y=2, a=b=c (all are assignments due to a special rule)
fr: x:=1, y=2, a=b=c (tout ici est affectation en vigueur d'une règle spéciale)

source: {Enter} and {Space}.
fr: {Enter} et {Space}.

source: #LTrim is positional:
fr: #LTrim est positionnelle :

source: EnvAdd, VarContainingTimestamp, -7, days.
fr: EnvAdd, VarAvecLeTemps, -7, days.

source: If with Else; Loop/For with Until; Try with Catch and/or Finally.
fr: If avec Else ; Loop/For avec Until ; Try avec Catch et/ou Finally.

source: Send is the command, anything after the comma (,) will be typed.
fr: Send est la commande, tout ce qui se trouve après la virgule (,) sera écrit.

source: A_Args[1] contains the first parameter.
fr: A_Args[1] contient le premier paramètre.

source: !A produces a different effect in some programs than !a.
fr: !A peut avoir dans certains programmes un effet différent de !a,

source: Binary operators are written in between their two operands.
fr: Les opérateurs binaires sont écrits au milieu de leurs deux opérandes.

source: Comments are portions of text within the script which are ignored by the program.
fr: Les commentaires sont des morceaux de texte dans le script ignorés par le programme.

source: Expressions are combinations of one or more values, variables, operators and function calls.
fr: Les expressions sont des combinaisons de valeurs, variables, opérateurs et appels de fonctions.

source: Functions take a varying number of inputs, perform some action or calculation, and then return a result.
fr: Les fonctions prennent un nombre variable d'entrées, effectuent une action ou des calculs, puis renvoient un résultat.

source: InputVar parameters can accept an expression only when the percent prefix is used.
fr: Les paramètres VarEntree n'acceptent une expression que si un préfixe pourcentage est utilisé.

source: Legacy or command syntax generally only allows a single action per line, but uses fewer characters to perform simple tasks such as sending keystrokes or running a program.
fr: La syntaxe dépassée (legacy) ou des commandes n'autorise en général qu'une seule action par ligne, mais utilise moins de caractères pour effectuer des tâches simples comme envoyer des frappes ou exécuter un programme.

source: Operators take the form of a symbol or group of symbols such as + or :=, or one of the words and, or, not or new.
fr: Les opérateurs prennent la forme d'un symbole ou d'un groupe de symboles comme + ou :=, ou l'un des mots and (et), or (ou), not (non) ou new (nouveau).

source: OutFile can be * to write the output to stdout.
fr: FichierSortie peut être * pour écrire la sortie dans stdout.

source: OutputVar and InputVar parameters require a variable name or dynamic variable reference.
fr: Les paramètres VarSortie et VarEntree demandent le nom d'une variable ou une référence dynamique de variable.

source: OutputVar parameters, which accept a variable reference using the same syntax as expressions.
fr: Les paramètres VarSortie, qui acceptent une référence de variable en utilisant la même syntaxe que les expressions.

source: Percent signs within an expression are used to create dynamic variable references and dynamic function calls.
fr: Les signes pourcentage dans une expression sont utilisés pour créer des références dynamiques de variable et des appels dynamiques de fonction.

source: Unary operators are written either before or after a single operand, depending on the operator.
fr: Les opérateurs unaires sont écrits avant ou après une seule opérande, selon l'opérateur.

source: Unquoted text is simply text, not enclosed in quote marks, just straight up.
fr: Du texte sans guillemets est simplement du texte, pas entouré de guillemets.

source: Values are numbers, objects or strings.
fr: Les valeurs sont des nombres, des objets ou des chaînes de caractères.

source: Variables can be used in an expression simply by writing the variable's name.
fr: Les variables peuvent être utilisées dans une expression en écrivant simplement le nom de la variable.

source: Alpha is an ordinary variable, and could be replaced with a function call or some other sub-expression which returns an object.
fr: Alpha est une variable ordinaire, et pourrait être remplacée par un appel de fonction ou une autre sous-expression renvoyant un objet.

source: Params must be a variable or sub-expression which returns an array object.
fr: Params doit être une variable ou une sous-expression qui renvoie un objet tableau.

source: "So, how exactly does a person such as myself create a hotkey?" Good question.
fr: "Donc, comment exactement est-ce qu'une personne comme moi créé une hotkey ?" Bonne question.

source: Index is any integer key.
fr: Index est une clé entière quelconque.

source: SERVER and PORT may be omitted.
fr: SERVEUR et PORT peuvent être omis.

source: By default, the hard carriage return (Enter) between the previous line and this one will be written to the file as a linefeed (`n).
fr: Par défaut, le retour chariot automatique (Entrée) entre la ligne précédente et celle-ci sera écrite dans le fichier comme retour à la ligne (`n).

source: By default, the tab to the left of this line will also be written to the file (the same is true for spaces).
fr: Par défaut, la tabulation à gauche de cette ligne sera aussi écrite dans le fichier (même chose pour des espaces).

source: By default, variable references such as %Var% are resolved to the variable's contents.
fr: Par défaut, les références de variable comme %Var% sont résolues vers le contenu de la variable.

source: - (subtraction)
fr: - (soustraction)

source: . / Delete
fr: . / Suppr

source: 0 / Insert
fr: 0 / Inser

source: 1 / End
fr: 1 / Fin

source: 3 / PageDown
fr: 3 / Page ↓

source: 5 / typically does nothing
fr: 5 / ne fait généralement rien

source: 7 / Home
fr: 7 / Début

source: 9 / PageUp
fr: 9 / Page ↑

source: CapsLock (caps lock key)
fr: Verr Maj (touche de verrouillage des majuscules)

source: Control.
fr: Ctrl.

source: Ctrl+Pause or Ctrl+ScrollLock
fr: Ctrl+Pause ou Ctrl+Arrêt défil

source: Help.
fr: Aide.

source: NumLock (number lock key).
fr: Verr Num (touche de verrouillage numérique).

source: PageDown (page down key)
fr: Page ↓ (touche page suivante)

source: PageUp (page up key)
fr: Page ↑ (touche page précédente)

source: Pause or Ctrl+NumLock.
fr: Pause ou Ctrl+Verr Num.

source: ScrollLock (scroll lock key).
fr: Arrêt défil (touche de verrouillage du défilement).

source: Shift.
fr: Maj.

source: Sleep.
fr: Veille.

source: Space (space bar)
fr: Espace (barre d'espace)

source: Tab (tabulator key)
fr: Tab (touche de tabulation)

source: Win (Windows logo key)
fr: Win (touche logo Windows)

source: ← (left arrow key)
fr: ← (touche flèche gauche)

source: ↑ (up arrow key)
fr: ↑ (touche flèche haut)

source: → (right arrow key)
fr: → (touche flèche droite)

source: ↓ (down arrow key)
fr: ↓ (touche flèche bas)

source: % (percent sign):
fr: % (signe pourcentage) :

source: , (comma):
fr: , (virgule) :

source: 7-zip Error: Use 7-zip or a compatible program to extract the setup files from the installer EXE, then run setup.exe or Installer.ahk (drag and drop Installer.ahk onto AutoHotkeyU32.exe).
fr: Erreur 7-zip : Utiliser 7-zip ou un programme compatible pour extraire les fichiers d'installation de l'installateur exécutable, puis lancer setup.exe ou Installer.ahk (glisser-déposer Installer.ahk sur AutoHotkeyU32.exe).

source: MyVar := SubStr("I'm scripting, awesome!", 16)
fr: MaVar := SubStr("Génial je scripte !", 16)

source: Alternate solutions:
fr: Solutions alternatives:

source: Caution: These commands do not follow the same rules as dynamic variable references.
fr: Attention : Ces commandes ne suivent pas les mêmes règles que les références dynamiques de variable.

source: Caution: This table does not apply to hotkeys.
fr: Attention : Ce tableau ne s'applique pas aux hotkeys.

source: Command Line:
fr: Ligne de Commande :

source: Comments (or Comment or Com or C) [v1.0.45.03+]:
fr: Comments (ou Comment ou Com ou C) [v1.0.45.03+] :

source: Common cause of confusion: There are several other types of If statements, some of which look very similar to If (expression).
fr: Cause de confusion courante : Il y a plusieurs autres types d'instructions If, certaines ayant l'air très similaires à If (expression).

source: Common: Unrecognized or badly formatted Gui, Gui Show or GuiControl options.
fr: Commun: Options Gui, Gui Show ou GuiControl non reconnues ou mal formatées.

source: ControlGetText, OutputVar , Control, WinTitle, WinText, ExcludeTitle, ExcludeText
fr: ControlGetText, VarSortie , Control, WinTitle, WinText, ExcludeTitle, ExcludeText

source: Declarations are optional: Except where noted on the functions page, variables do not need to be declared; they come into existence simply by using them (and each variable starts off empty/blank).
fr: Les déclarations sont facultatives : Sauf là où c'est précisé sur la page des fonctions, les variables n'ont pas besoin d'être déclarées ; elles existent par leur simple utilisation (et chaque variable commence sans contenu, vide).

source: Deprecated: Use the synonym Enter instead to reduce ambiguity.
fr: Déconseillé: Utilisez plutôt le synonyme Enter pour réduire l'ambiguïté.

source: Deprecated: Use the synonym Pause instead.
fr: Déconseillé: Utilisez plutôt le synonyme Pause.

source: Extract:
fr: Extraire :

source: GUI Interface:
fr: Interface GUI :

source: Joy1 through Joy32:
fr: Joy1 à Joy32:

source: JoyU and JoyV:
fr: JoyU et JoyV:

source: JoyX, JoyY, and JoyZ:
fr: JoyX, JoyY et JoyZ:

source: Known issue: Keyboard shortcuts for menu items do not work while the script is displaying a MsgBox or other dialog.
fr: Problème connu : Les raccourcis claviers pour les options des menus ne marchent pas pendant que le script affiche une MsgBox ou un autre dialogue.

source: Known limitation: VK hotkeys that are forced to use the keyboard hook, such as *VK24 or ~VK24, will fire for only one of the keys, not both (e.g. NumpadHome but not Home).
fr: Limitation connue: Les Hotkeys VK doivent utiliser le hook clavier, comme * VK24 ou ~ VK24, va donc déclancher pour seulement une des touches, pas les deux (ex. PavnumDébut mais pas Début).

source: Known limitation: dragging files onto a .ahk script may fail to work properly if 8-dot-3 (short) names have been turned off in an NTFS file system.
fr: Problème connu : déposer des fichiers sur un script .ahk peut échouer à fonctionner correctement si les noms (courts) 8-dot-3 ont été désactivé dans un système de fichier NTFS.

source: Known limitations:
fr: Limitations connues :

source: Legacy: The command line parameters are also stored in the variables %1%, %2%, and so on, as in versions prior to [v1.1.27].
fr: Dépassé : Les paramètres de ligne de commande sont aussi stockés dans les variables %1%, %2%, et ainsi de suite, comme dans les versions précédant [v1.1.27].

source: Line breaks are meaningful: Line breaks generally act as a statement separator, terminating the previous command or expression.
fr: Les retours à la ligne ont une signification : Les retours à la ligne agissent généralement comme un séparateur entre les instructions, terminant la commande ou expression précédente.

source: Line continuation: Long lines can be divided up into a collection of smaller ones to improve readability and maintainability.
fr: Continuation de ligne : Les lignes longues peuvent être divisées en un ensemble de lignes plus petites pour améliorer la lisibilité et la maintenabilité.

source: Method #1:
fr: Méthode #1 :

source: Method #2:
fr: Méthode #2 :

source: Multiple Joysticks:
fr: Joysticks multiples:

source: Names: Variable and function names are not case sensitive (for example, CurrentDate is the same as currentdate).
fr: Noms : Les noms de variable et de fonction ne sont pas sensibles à la casse (par exemple, DateActuelle et dateactuelle sont identiques).
